package com.example.andy.player.bean;

/**
 * Created by andy on 2017/12/25.
 */

public class Lyric extends AbstractClass{

    /**
     * ret_code : 0
     * lyric : [ti&#58;海阔天空&#32;&#40;Edited&#32;Version&#41;]&#10;[ar&#58;BEYOND]&#10;[al&#58;Words&#32;&#38;&#32;Music&#32;Final&#32;Live&#32;With&#32;家驹]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;92]海阔天空&#32;&#32;&#45;&#32;BEYOND&#10;[00&#58;02&#46;27]词：黄家驹&#10;[00&#58;03&#46;32]曲：黄家驹&#10;[00&#58;04&#46;30]&#10;[00&#58;19&#46;17]今天我&#32;寒夜里看雪飘过&#10;[00&#58;25&#46;75]怀着冷却了的心窝飘远方&#10;[00&#58;30&#46;77]&#10;[00&#58;31&#46;60]风雨里追赶&#32;雾里分不清影踪&#10;[00&#58;37&#46;82]天空海阔你与我&#32;可会变&#10;[00&#58;43&#46;27]&#10;[00&#58;44&#46;14]多少次迎着冷眼与嘲笑&#10;[00&#58;50&#46;55]从没有放弃过心中的理想&#10;[00&#58;56&#46;02]&#10;[00&#58;56&#46;67]一刹那恍惚&#32;若有所失的感觉&#10;[01&#58;02&#46;65]不知不觉已变淡&#32;心里爱&#10;[01&#58;08&#46;64]&#10;[01&#58;09&#46;66]原谅我这一生不羁放纵爱自由&#10;[01&#58;15&#46;56]&#10;[01&#58;16&#46;40]也会怕有一天会跌倒&#10;[01&#58;22&#46;72]背弃了理想谁人都可以&#10;[01&#58;27&#46;84]&#10;[01&#58;28&#46;51]哪会怕有一天只你共我&#10;[01&#58;33&#46;89]&#10;[01&#58;43&#46;41]今天我&#32;寒夜里看雪飘过&#10;[01&#58;49&#46;76]怀着冷却了的心窝飘远方&#10;[01&#58;54&#46;86]&#10;[01&#58;55&#46;60]风雨里追赶&#32;雾里分不清影踪&#10;[02&#58;01&#46;92]天空海阔你与我&#32;可会变&#10;[02&#58;06&#46;61]&#10;[02&#58;08&#46;70]原谅我这一生不羁放纵爱自由&#10;[02&#58;14&#46;86]&#10;[02&#58;15&#46;55]也会怕有一天会跌倒&#10;[02&#58;21&#46;30]&#10;[02&#58;21&#46;83]背弃了理想谁人都可以&#10;[02&#58;27&#46;17]&#10;[02&#58;28&#46;08]哪会怕有一天只你共我&#10;[02&#58;33&#46;08]&#10;[02&#58;38&#46;06]仍然自由自我&#10;[02&#58;40&#46;57]&#10;[02&#58;41&#46;42]永远高唱我歌&#10;[02&#58;44&#46;42]走遍千里&#32;原谅我这一生不羁放纵爱自由&#10;[02&#58;55&#46;20]&#10;[02&#58;56&#46;14]也会怕有一天会跌倒&#10;[03&#58;02&#46;26]背弃了理想&#32;谁人都可以&#10;[03&#58;07&#46;48]&#10;[03&#58;08&#46;67]哪会怕有一天只你共我&#10;[03&#58;13&#46;58]&#10;[03&#58;14&#46;51]原谅我这一生不羁放纵爱自由&#10;[03&#58;21&#46;27]也会怕有一天会跌倒&#10;[03&#58;26&#46;00]&#10;[03&#58;27&#46;38]背弃了理想谁人都可以&#10;[03&#58;31&#46;94]&#10;[03&#58;33&#46;61]哪会怕有一天只你共我
     * lyric_txt :                                  海阔天空            BEYOND      词：黄家驹      曲：黄家驹            今天我   寒夜里看雪飘过      怀着冷却了的心窝飘远方            风雨里追赶   雾里分不清影踪      天空海阔你与我   可会变            多少次迎着冷眼与嘲笑      从没有放弃过心中的理想            一刹那恍惚   若有所失的感觉      不知不觉已变淡   心里爱            原谅我这一生不羁放纵爱自由            也会怕有一天会跌倒      背弃了理想谁人都可以            哪会怕有一天只你共我            今天我   寒夜里看雪飘过      怀着冷却了的心窝飘远方            风雨里追赶   雾里分不清影踪      天空海阔你与我   可会变            原谅我这一生不羁放纵爱自由            也会怕有一天会跌倒            背弃了理想谁人都可以            哪会怕有一天只你共我            仍然自由自我            永远高唱我歌      走遍千里   原谅我这一生不羁放纵爱自由            也会怕有一天会跌倒      背弃了理想   谁人都可以            哪会怕有一天只你共我            原谅我这一生不羁放纵爱自由      也会怕有一天会跌倒            背弃了理想谁人都可以            哪会怕有一天只你共我
     */

    private int ret_code;
    private String lyric;


    public int getRet_code() {
        return ret_code;
    }

    public void setRet_code(int ret_code) {
        this.ret_code = ret_code;
    }

    public String getLyric() {
        return lyric;
    }

    public void setLyric(String lyric) {
        this.lyric = lyric;
    }

}
